/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "gp_section_592053312556106636": {
      "settings": {
        "checksum": "1a3ec19a91fca3fdb0d04498ec2e0f67e6e28e1ea69a56b610c4a2acb4ef1aa8_1_1_1_0__1",
        "gg3T0U2BKEg_placeholder": "Email",
        "gg8m8kfovaa_text": "<p>Most Popular Blogs</p>",
        "ggA3Psqznfl_text": "<p>More Blogs About</p>",
        "ggJTO0OA8nf_text": "<p><a href=\"https://www.procolored.com/blogs/news/tagged/industry-trends\" target=\"_blank\">industry trends</a></p><p><a href=\"https://www.procolored.com/blogs/news/tagged/maintenance\" target=\"_blank\">maintenance</a></p><p><a href=\"https://www.procolored.com/blogs/news/tagged/newsroom\" target=\"_blank\">newsroom</a></p><p><a href=\"https://www.procolored.com/blogs/news/tagged/product-showroom\" target=\"_blank\">product showroom</a></p><p><a href=\"https://www.procolored.com/blogs/review\" target=\"_blank\">printer review</a></p>",
        "ggL_fqYDx2B_text": "<p><a href=\"https://www.procolored.com/blogs/news/how-to-achieve-premium-results-in-digital-specialty-printing\" target=\"_blank\">How to Achieve Premium Results in Digital Specialty Printing</a></p>",
        "gght-PoKUCn_text": "<p><a href=\"https://www.procolored.com/blogs/news/dtg-printing-101-the-top-10-faqs\" target=\"_blank\">DTG Printing 101: The Top 10 FAQs</a></p>",
        "ggmuwu3zLKJ_text": "Subscribe",
        "ggnC8UooLBr_text": "<p>To join our mailing list</p><p>and never miss our updates !</p>",
        "ggnEUcSVXBt_text": "<p><span style=\"font-size:15px;\">Simon has worked in inkjet printing industry for years. &nbsp;He has the rare ability to see print related issues from many perspectives. Witnessing the gradual development of digital printing especially inkjet printing, Simon knows better about what the users are looking for and how the new technologies will truly help big or small businesses.</span></p>",
        "ggpAvqpSmHh_errorMessage": "Can’t send email. Please try again later.",
        "ggpAvqpSmHh_successMessage": "Thanks for contacting us. We'll get back to you as soon as possible.",
        "ggphxxcq0Vn_label": "Subscribe Now",
        "ggw3ZXqMaf3_text": "<p><span style=\"font-size:16px;\"><i>About the Author - Simon</i></span></p>"
      },
      "type": "gp-section-592053312556106636"
    },
    "gp_section_592053312556172172": {
      "settings": {
        "checksum": "86d0ff7b63ad4d70240758f4ea41ca2fe4716d5e1168adb7d711eddb8d57378b_1_1_1_0__1",
        "gg-VRf0cHI2_text": "<p><strong>Roller-feed system for continuous film</strong> — This model includes a roller version (L1800) which simplifies handling of roll film inputs, reducing jams and feeding issues so the print workflow remains smoother and more reliable.</p><p>&nbsp;</p><p><strong>White-ink circulation to protect hardware</strong> — A dedicated white ink circulation system helps maintain consistent flow and prevents blockages or print-head damage, which supports longer print-head life and less downtime.</p><p>&nbsp;</p><p><strong>Automatic print-head cleaning</strong> — The printer automatically runs cleaning cycles (every 10 hours of idle time) using minimal ink, ensuring maintenance remains low-effort and the print-quality stays high.</p><p>&nbsp;</p><p><strong>Pre-heating and film-adsorption calibration</strong> — Features like adjustable pre-heat for printed ink and precise film-adsorption hold ensure consistent print output, less warping or mis-transfer, and higher reliability across jobs.</p>",
        "gg011XcA8kr_text": "<p><span style=\"font-size:30px;\">3. </span><a href=\"https://www.procolored.com/products/13-dual-heads-dtf-pro-a3-dtf-transfer-printer-oven\"><span style=\"font-size:30px;\"><u>Procolored F13 Pro Panda DTF Printer 13\" A3 Dual XP600 &amp; Oven - $500 OFF</u></span></a></p>",
        "gg1pN3Q_nSv_text": "<p>From November 1 to November 23, Procolored members can earn double points during the Black Friday event — you’ll get 1x instant points when you make a purchase, and another 1x bonus points will be automatically credited to your account in December. It’s the perfect time to join and make every purchase more rewarding.</p>",
        "gg4x74DfD4w_text": "<p>Mark your calendar: <strong>from November 1 to November 23</strong>, Procolored invites you to take part in our <a href=\"https://www.procolored.com/pages/procolored-black-friday-2025\"><u>Black Friday early bird event</u></a>. This is a rare opportunity to enjoy massive savings, weekly giveaways, and limited-time flash deals — all designed for our valued customers in the United States . Read on to discover how you can make the most of this campaign. Check out the printers on sale and you might find one that suits your needs.</p>",
        "gg5BRuajkk9_text": "<span style=\"font-size:30px;\">A. Store-wide Tiered Black Friday Deal</span>",
        "gg63jb6oDhy_text": "<p><span style=\"font-size:30px;\">1. </span><a href=\"https://www.procolored.com/products/procolored-k13-lite-dtf-printer-13-a3-oven-premium-white\"><span style=\"font-size:30px;\"><u>Procolored K13 Lite DTF Printer 13\" A3 &amp; Oven Premium - White - $1200 OFF</u></span></a></p>",
        "gg7t8XD2gFv_text": "<p>From November 1 to November 23, every week we’ll launch 3–5 consumables products in a limited-quantity flash sale (<strong>only 100 units each</strong>). These sales are time-limited and quantity-limited — once sold out, they’re gone. The exact items and schedule will be published on the official website under “Consumables Flash-Sale Price”.</p><p>&nbsp;</p><p>This is a perfect opportunity to grab premium ink, film, or accessory packs at exceptional prices — ideal if you’re already planning to stock up.</p>",
        "gg91voz-tDi_text": "<p><span style=\"font-size:30px;\">2. </span><a href=\"https://www.procolored.com/products/procolored-p13-dtf-printer-13-a3-xp600-oven-windows\"><span style=\"font-size:30px;\"><u>Procolored P13 DTF Printer 13\" A3 XP600 &amp; Oven - $300 OFF</u></span></a></p>",
        "gg9JncMcWGZ_text": "<p><span style=\"font-size:30px;\">D.Join and Earn Double Points</span></p>",
        "ggB7wEPxHQ3_errorMessage": "Can’t send email. Please try again later.",
        "ggB7wEPxHQ3_successMessage": "Thanks for contacting us. We'll get back to you as soon as possible.",
        "ggC_kKO9rgD_text": "<p>Table of Contents</p>",
        "ggCzXY_IT0i_text": "<p><a href=\"https://www.procolored.com/blogs/news/dtg-printing-101-the-top-10-faqs\" target=\"_blank\">DTG Printing 101: The Top 10 FAQs</a></p>",
        "ggE0cGiBi_9_text": "<p>The event officially runs <strong>from November 1 through November 23</strong>. Within this period we host multiple promotions: store-wide tiered discounts, official prize draws, and weekly flash deals.&nbsp;</p><p>&nbsp;</p><p>Throughout this <a href=\"https://www.procolored.com/collections/black-friday-sale\"><u>Black Friday deal</u></a>, you can take advantage of various limited-time offers, ensuring there’s something for everyone. From substantial discounts on select products to exciting prize draws, each week brings new opportunities to save and win. Whether you're looking to upgrade your equipment or stock up on consumables, this early bird campaign is designed to offer maximum value. Be sure to mark your calendar and stay updated on all the deals, as the event features <strong>exclusive offers that won’t last long</strong>!</p>",
        "ggE8S1Qd7a8_text": "<p><strong>Direct-to-object printing support</strong> — The machine can print directly onto a variety of surfaces (such as acrylic, phone cases, leather, cards or usb drives) thanks to its UV-ink system and compatibility with textured or flat materials.</p><p>&nbsp;</p><p><strong>Stable ink supply with six-colour option</strong> — Featuring a CMYK+WW (white + white) ink set and about stable circulation, the system supports vibrant output even when printing transparent, coloured or dark objects.</p><p>&nbsp;</p><p><strong>Adjustable Print Height</strong> — The infrared print height sensor provides automatic adjustment, effectively protecting the printhead from damage.</p><p>&nbsp;</p><p><strong>Powerful Cooling System</strong> — Featuring advanced air cooling design, it supports long-duration, efficient, and stable printing.</p><p>&nbsp;</p><p><strong>Built-in UV Light </strong>— The built-in UV lamp quickly cures the printed ink, thereby improving work efficiency.</p>",
        "ggEtmIfWUum_text": "<p>Everyone who shopps at our official website can benefit from the following tiered discount structure:</p><p>&nbsp;</p><p>Spend $2,399 or more → Save $200<br>Spend $3,499 or more → Save $300<br>Spend $4,699 or more → Save $400<br>Spend $5,699 or more → Save $500<br>Spend $7,299 or more → Save $700<br>Spend $8,999 or more → Save $900</p><p>&nbsp;</p><p><strong>Note</strong>: The special model K13 Lite is excluded from the tiered discount. Its special sale price during Black Friday is handled separately on the official website.</p><p>&nbsp;</p><p>This tiered approach rewards those who spend more with larger savings, making it an ideal opportunity to combine your purchases or upgrade to a more advanced product.</p><p>&nbsp;</p><p>If you're looking for a reliable printer, we have a wide selection of printers for sale that offer great value during this event.</p>",
        "ggHKvyiG8n1_text": "<p><span style=\"font-size:30px;\">Final Words: How to Make the Most of the Procolored Black Friday Event</span></p>",
        "ggJDFv88CAq_text": "<p>More Blogs About</p>",
        "ggKQcmm3ScK_text": "<p><strong>Procolored Black Friday Early Bird Event Schedule</strong></p><p><strong>Procolored Black Friday Early Bird Event Details</strong></p><p><strong>Procolored Featured Products: Black Friday Deals</strong><br><strong>Final Words: How to Make the Most of the Procolored Black Friday Event</strong></p>",
        "ggLboDUr1B__text": "<span style=\"font-size:30px;\">C. Black Friday Flash-Sale (“Seckill”) Activity</span>",
        "ggMySI1SnL__text": "<p><strong>Compact format for small-space operations</strong> — With A4 printing size and single-head design, the model fits neatly into home studios, craft rooms or smaller business environments without sacrificing essential DTF functionality.</p><p>&nbsp;</p><p><strong>Single-head simplicity</strong> — Using a single printhead setup makes the machine easier to operate and maintain, which can be especially valuable for users who are new to direct-to-film (DTF) printing or focused on smaller batch production.</p><p>&nbsp;</p><p><strong>Lower entry cost and maintenance</strong> — The straightforward design with fewer moving parts means fewer components to service, which may help reduce both up-front cost and ongoing upkeep compared to larger, multi-head systems.</p><p>&nbsp;</p><p><strong>Optimised for textile transfers</strong> — This printer is designed specifically for DTF transfer film output, making it well-suited for personalising apparel, accessories or small merchandise runs where versatility and convenience matter.</p>",
        "ggOl_FHeSLN_text": "<p><span style=\"font-size:30px;\">5. </span><a href=\"https://www.procolored.com/products/12-single-head-a4-dtf-printer-direct-to-film-printer-l805-with-oven\"><span style=\"font-size:30px;\"><u>Procolored F8 Panda DTF Printer 8.2\" A4 L800 &amp; Oven - $200 OFF</u></span></a></p>",
        "ggPrg_gtXV__text": "<p><span style=\"font-size:30px;\">6. </span><a href=\"https://www.procolored.com/products/13-2-in-1-dual-heads-a3-mini-uv-dtf-sticker-printer\"><span style=\"font-size:30px;\"><u>Procolored VF13 Pro Panda UV DTF Printer 13\" A3+ Dual XP600 2-in-1 - $500 OFF</u></span></a></p>",
        "ggS6nUWh9es_text": "<p>This is your chance to discover some of the best of the Black Friday deals for 2025. If you’ve been searching for a cheap printer without compromising on quality, now is the perfect time to make your move. Whether you’re an entrepreneur looking to expand your printing business or a hobbyist in need of reliable equipment, Procolored’s event offers unbeatable prices on top-tier machines and consumables. Don’t miss out on these exclusive deals, designed to give you the best value for your investment.</p>",
        "ggT9L60BwFg_text": "<p><strong>Dual print-head configuration</strong> — Equipped with two XP600 heads, this machine handles large print jobs more quickly and efficiently than single-head systems, reducing waiting time and improving throughput.</p><p>&nbsp;</p><p><strong>“Siphon Circulation” ink system</strong> — The model features Procolored’s ink circulation design which significantly lowers the risk of clogging and minimizes maintenance needs over time.</p><p>&nbsp;</p><p><strong>Auto-cleaning printhead</strong> — An automatic cleaning routine runs at regular intervals (e.g., every 10 hours) using minimal ink, which helps keep the hardware in top condition and reduces manual upkeep.</p><p>&nbsp;</p><p><strong>Versatile fabric compatibility</strong> — Because it uses a dual-head DTF (Direct-to-Film) method and integrates white ink processing, it supports a wide range of substrates — from dark cotton to mixed-material blends — with fewer limitations.</p><p>&nbsp;</p><p><strong>High-Quality Printing Results</strong> — The F13 Pro is equipped with a dual printhead system that produces high-resolution images and effectively reduces color distortion, ensuring each print delivers stable and professional industrial-grade quality.</p>",
        "ggTNV_PyNFr_text": "<p>To get the maximum return from this campaign, here’s your action plan:</p><ol><li><strong>Select your items by early November.</strong> If you’re targeting the tiered discount, plan to place your order between Nov 1–30. If you want to enter the prize draw, make sure your purchase falls between Nov 1–23.</li><li><strong>Watch the flash-sale schedule weekly.</strong> Consumables will go fast (limited to 100 units each), so check the “Consumables Flash-Sale Price” section on the website regularly.</li><li><strong>Bundle your purchases.</strong> If you’re buying both machine + consumables, doing so during the discount window means stacking savings and getting more value for your spend.</li><li><strong>Keep your details up to date.</strong> For the prize draws, you must be a customer of our site between the dates specified. Winners will be announced on the website and social media, and prizes start shipping December 1.</li><li><strong>Plan long-term.</strong> Whether you’re a business owner or a serious hobbyist, this is not just a one-time sale. By choosing <a href=\"https://www.procolored.com/\"><u>Procolored</u></a> now you lock in advanced tech, matched consumables and a network of support — plus you get the upfront savings and prizes.</li></ol>",
        "ggViHNW-RMW_text": "<p><strong>2-in-1 print &amp; laminate workflow</strong> — The machine combines direct printing and lamination in a single process (print on A film → laminate with B film → transfer), simplifying sticker production for flat, curved or irregular objects.</p><p>&nbsp;</p><p><strong>Compact design built for workflow</strong> — With openable side doors and a smaller footprint, this model enables easier access for maintenance and fits more comfortably in smaller studios or creative spaces.</p><p>&nbsp;</p><p><strong>Auto-maintenance friendly</strong> — The printhead undergoes automatic cleaning at regular intervals (e.g., every 10 hours of idle time) to reduce the threat of clogging and lengthen hardware reliability.</p><p>&nbsp;</p><p><strong>Optional stand with film-rewinder support</strong> — For roll-based workflows, the optional base stand with an electric rewinder helps neatly manage film waste and improve handling during production</p>",
        "ggXVyTcVVK3_text": "Subscribe",
        "ggYTDv9CJk4_text": "<p><strong>Supports direct to film and direct to object workflows</strong> — The printer is built to handle UV‑DTF transfers onto adhesive film and flat‑bed printing onto rigid or irregular surfaces such as metal, acrylic, leather and more.</p><p>&nbsp;</p><p><strong>Adjustable UV lamp power &amp; air filtration</strong> — The UV lamp power can be tuned according to material type to avoid overheating, and the integrated air‑filter system reduces ink‑odour and dust by over 70 %, allowing indoor use in more locations.</p><p>&nbsp;</p><p><strong>High-Resolution Printing</strong> — The printer uses micro piezoelectric technology and intelligent ink drop control to achieve smooth color transitions with printing precision within 1 mm. The output features rich details, natural gradients, and near-perfect color accuracy—close to 100% true-to-life reproduction.</p><p>&nbsp;</p><p><strong>Automatic Printhead Cleaning</strong> — The printhead performs an automatic self-cleaning cycle every 10 hours, effectively protecting it and extending the overall lifespan of the printer.</p>",
        "ggZh3Z54tpd_text": "<p>To join our mailing list</p><p>and never miss our updates !</p>",
        "gg_9PdIVGz-_placeholder": "Email",
        "ggaE68rFUUZ_text": "<p>Here are some of the key products you should keep your eye on:</p>",
        "ggadDawpkbm_text": "<p>Most Popular Blogs</p>",
        "ggbxye-NCZR_label": "Subscribe Now",
        "ggdiPJqiEx2_text": "<p><span style=\"font-size:30px;\">Procolored Black Friday Early Bird Event Schedule</span></p>",
        "ggfCTw7ukaD_text": "<p><span style=\"font-size:30px;\">4. </span><a href=\"https://www.procolored.com/products/13-single-head-a3-dtf-printer-direct-to-film-printer-roller-version-l1800-oven\"><span style=\"font-size:30px;\"><u>Procolored F13 Panda DTF Printer 13\" A3 L1800 &amp; Oven - $300 OFF</u></span></a></p>",
        "gggXHGWeaOS_text": "<p><span style=\"font-size:30px;\">Procolored Featured Products: Black Friday Deals</span></p>",
        "gghEbFESl_2_text": "<p>In addition to the instant discounts, we are running an <a href=\"https://www.procolored.com/pages/black-friday-luck-draw\"><u>official giveaway</u></a> for customers who purchase between November 1 and November 23. Draw dates are: <i><strong>Nov 8, Nov 15, and Nov 24</strong></i>. Winners will be announced on our website and via social media channels.</p>",
        "gghbZCoKGkX_text": "<span style=\"font-size:30px;\">B. Black Friday Printer Early Bird Official Prize Draw</span>",
        "gginIDii_lD_text": "<p><span style=\"font-size:30px;\">7. </span><a href=\"https://www.procolored.com/products/6-7-single-head-a4-uv-printer-panda\"><span style=\"font-size:30px;\"><u>Procolored V6 Panda UV Printer 6.7\" A4 L800 - $300 OFF</u></span></a></p>",
        "ggkTUmfTeRQ_text": "<p><a href=\"https://www.procolored.com/blogs/news/how-to-achieve-premium-results-in-digital-specialty-printing\" target=\"_blank\">How to Achieve Premium Results in Digital Specialty Printing</a></p>",
        "ggmUhtrmvga_text": "<p><strong>Integrated “smoke-free” oven</strong> — This model pairs the printer with an upgraded oven designed to reduce air pollution and unpleasant odors typical of DTF (direct-to-film) printing. That makes it more suitable for indoor or smaller workshop settings where ventilation may be limited.</p><p>&nbsp;</p><p><strong>Beginner-friendly maintenance design</strong> — The printer features a “LiteHead” technology aimed at reducing maintenance costs, plus automatic cleaning and one-touch ink pumping. These features help prevent common issues like clogging or ink drying, making it accessible for first-time users.</p><p>&nbsp;</p><p><strong>White-ink circulation &amp; color-accuracy tools</strong> — A white-ink circulation system runs every 30 minutes to keep flow consistent; additionally, the printer is G7 colour certified and uses calibrated colour curves and professional RIP software. These features help deliver more reliable colour output — which is very relevant when you’re printing on dark or coloured substrates.</p><p>&nbsp;</p><p><strong>Compact yet capable format (A3 size) </strong>— With a 13″ (A3) print width, this machine provides a balance between space-footprint and capability. For many small businesses or home studios wanting to move into DTF printing, this offers a practical size.</p><p>&nbsp;</p><p><strong>Customisable user interface</strong> — The machine offers an intuitive touchscreen interface with preset themes, helping to simplify user experience and make it more approachable for operators new to DTF workflows.</p>",
        "ggnsdLrtdHx_text": "<p><strong>Prizes:</strong></p><p>Grand Prize (1 person): iPhone 17</p><p>1st Prize (5 people): Labubu collectible figure</p><p>2nd Prize (9 people): A set of 500 ml ink supplies (depending on the machine model)</p><p>3rd Prize (15 people): US$100 discount coupon for consumables</p><p>Lucky Prize (all other participating customers): US$20 discount coupon for consumables.</p><p>&nbsp;</p><p>Prize delivery begins on <strong>December 1</strong>. Be sure your shipping and contact details are correct in your order.</p>",
        "ggoqFTWw50F_text": "<p><span style=\"font-size:30px;\">8. </span><a href=\"https://www.procolored.com/products/11-8-dual-heads-a3-uv-printer-a3-pro\"><span style=\"font-size:30px;\"><u>Procolored V11 Pro UV Printer 11.4\" A3 Dual TX800 - $500 OFF</u></span></a></p>",
        "ggpBRlsvkqE_text": "<p><strong>4.5pL Minimum Ink Drop Size</strong> — The printer delivers ultra-fine 4.5pL ink droplets, producing richer, more delicate colors while reducing the chance of nozzle blockage. This ensures refined printing results and easier long-term maintenance.</p><p>&nbsp;</p><p><strong>Automatic Cleaning System</strong> — The built-in cleaning program offers 12-, 24-, and 36-hour timer options, helping maintain smooth ink flow while saving consumables. It strikes a smart balance between effective maintenance and ink conservation.</p><p>&nbsp;</p><p><strong>Six-Channel Printhead</strong> — Since DTF printing requires CMYK and white inks to work together, the P13 uses a six-channel printhead that combines all colors within one unit. Compared with setups that rely on dual four-channel heads, this design delivers greater efficiency and consistency.</p><p>&nbsp;</p><p><strong>Home-Inspired Design</strong> — The P13 features a wood-grain finish that blends naturally into a home studio or creative workspace, giving it a warm and modern look that suits everyday environments.</p><p>&nbsp;</p><p><strong>Multiple System Versions</strong> — Available in both Windows- and Mac-compatible models, allowing users to choose the version that best matches their computer system.</p><p>&nbsp;</p><p><strong>Laser Detection System</strong> — The integrated laser sensor continuously monitors film flatness, preventing the printhead from scratching the film and protecting both your prints and hardware while reducing long-term maintenance costs.</p><p>&nbsp;</p><p><strong>Waste Ink Alarm Function</strong> — The upgraded waste-ink bottle alert notifies you before overflow occurs, keeping your workspace clean and organized while minimizing unnecessary cleanup.</p>",
        "ggtfPp7M6vA_text": "<p><a href=\"https://www.procolored.com/blogs/news/tagged/industry-trends\" target=\"_blank\">industry trends</a></p><p><a href=\"https://www.procolored.com/blogs/news/tagged/maintenance\" target=\"_blank\">maintenance</a></p><p><a href=\"https://www.procolored.com/blogs/news/tagged/newsroom\" target=\"_blank\">newsroom</a></p><p><a href=\"https://www.procolored.com/blogs/news/tagged/product-showroom\" target=\"_blank\">product showroom</a></p><p><a href=\"https://www.procolored.com/blogs/review\" target=\"_blank\">printer review</a></p>"
      },
      "type": "gp-section-592053312556172172"
    },
    "gp_section_592053312556237708": {
      "settings": {
        "checksum": "e88dd1297edb304fc1799d74bd8c34a02f4e6bf2ebcedaec88ac867e9ace8cbb_1_1_1_0__1",
        "ggEDzZghpU2_text": "<p>Written by <span style=\"color:#050404;\">Procolored</span> - Published on&nbsp;<span style=\"color:#000000;\"> Nov. 6, 2025</span></p>",
        "ggVWrF204ov_text": "<p>Share:</p>",
        "gganByn9hBD_text": "<p>Share:</p>",
        "ggpYAD2j5Oa_text": "<p>9 minutes read</p>",
        "ggu-3SYG5mk_text": "Discover Procolored Black Friday Early Bird Event 2025",
        "ggwkC-T9ZoM_text": "<p>9 minutes read</p>",
        "ggz_Tut7WFk_text": "<p>Written by <span style=\"color:#050404;\">Procolored</span> - Published on <span style=\"color:#000000;\">Sept 4, 2025</span></p>",
        "section_preload": "true"
      },
      "type": "gp-section-592053312556237708"
    }
  },
  "order": [
    "gp_section_592053312556237708",
    "gp_section_592053312556172172",
    "gp_section_592053312556106636"
  ]
}
