/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "gp_section_592155965848027678": {
      "settings": {
        "checksum": "ab70810ad4eeae922e035f3db69b466085bc68288db9f65446aa273d7ff19fc6_1_1_1_0__1",
        "gg3T0U2BKEg_placeholder": "Email",
        "gg8m8kfovaa_text": "<p>Most Popular Blogs</p>",
        "ggA3Psqznfl_text": "<p>More Blogs About</p>",
        "ggJTO0OA8nf_text": "<p><a href=\"https://www.procolored.com/blogs/news/tagged/industry-trends\" target=\"_blank\">industry trends</a></p><p><a href=\"https://www.procolored.com/blogs/news/tagged/maintenance\" target=\"_blank\">maintenance</a></p><p><a href=\"https://www.procolored.com/blogs/news/tagged/newsroom\" target=\"_blank\">newsroom</a></p><p><a href=\"https://www.procolored.com/blogs/news/tagged/product-showroom\" target=\"_blank\">product showroom</a></p><p><a href=\"https://www.procolored.com/blogs/review\" target=\"_blank\">printer review</a></p>",
        "ggL_fqYDx2B_text": "<p><a href=\"https://www.procolored.com/blogs/news/how-to-achieve-premium-results-in-digital-specialty-printing\" target=\"_blank\">How to Achieve Premium Results in Digital Specialty Printing</a></p>",
        "gght-PoKUCn_text": "<p><a href=\"https://www.procolored.com/blogs/news/dtg-printing-101-the-top-10-faqs\" target=\"_blank\">DTG Printing 101: The Top 10 FAQs</a></p>",
        "ggmuwu3zLKJ_text": "Subscribe",
        "ggnC8UooLBr_text": "<p>To join our mailing list</p><p>and never miss our updates !</p>",
        "ggnEUcSVXBt_text": "<p><span style=\"font-size:15px;\">Simon has worked in inkjet printing industry for years. &nbsp;He has the rare ability to see print related issues from many perspectives. Witnessing the gradual development of digital printing especially inkjet printing, Simon knows better about what the users are looking for and how the new technologies will truly help big or small businesses.</span></p>",
        "ggpAvqpSmHh_errorMessage": "Can’t send email. Please try again later.",
        "ggpAvqpSmHh_successMessage": "Thanks for contacting us. We'll get back to you as soon as possible.",
        "ggphxxcq0Vn_label": "Subscribe Now",
        "ggw3ZXqMaf3_text": "<p><span style=\"font-size:16px;\"><i>About the Author - Simon</i></span></p>"
      },
      "type": "gp-section-592155965848027678"
    },
    "gp_section_592155965848093214": {
      "settings": {
        "checksum": "02165b5d52ba362fb07cc70acc2d1778e579ffeae370c4cd1acbb1109b62512d_1_1_1_0__1",
        "ggEDzZghpU2_text": "<p>Written by <span style=\"color:#050404;\">Procolored</span> - Published on&nbsp;<span style=\"color:#000000;\"> Oct. 22, 2025</span></p>",
        "ggVWrF204ov_text": "<p>Share:</p>",
        "gganByn9hBD_text": "<p>Share:</p>",
        "ggpYAD2j5Oa_text": "<p>9 minutes read</p>",
        "ggu-3SYG5mk_text": "How to Select a Printer in Photoshop CC?",
        "ggwkC-T9ZoM_text": "<p>9 minutes read</p>",
        "ggz_Tut7WFk_text": "<p>Written by <span style=\"color:#050404;\">Procolored</span> - Published on <span style=\"color:#000000;\">Sept 4, 2025</span></p>",
        "section_preload": "true"
      },
      "type": "gp-section-592155965848093214"
    },
    "gp_section_592155965848158750": {
      "settings": {
        "checksum": "5dff9787d0d66a84c1ade3ab6f37697483c0eda39ac8e61bb3272d657979f94e_1_1_1_0__1",
        "gg-VRf0cHI2_text": "<p>Seriously, why would you redo the same settings over and over? Just save your go-to print setup as a custom preset. That means once you’ve nailed your <a href=\"https://www.procolored.com/collections/dtf-printer\"><u>DTF film</u></a> settings—resolution, color management, media type, all that—you just click once next time. This won’t just speed your things but also make sure you get consistent results every time.</p>",
        "gg011XcA8kr_text": "<p>3.White Ink Not Appearing</p>",
        "gg1UOdoR78G_text": "<p>Optimizing Print Quality for DTF in Photoshop</p>",
        "gg1dviSmqjA_text": "<p>Printing from Photoshop always sounds easy—until it’s not. Stuff goes sideways, even when you swear you did everything right. So, if you’re tearing your hair out over DTF printing, here’s a quick little cheat sheet to (hopefully) save your PEACE:</p>",
        "gg4x74DfD4w_text": "<p><span style=\"font-size:25px;\">Ever hit “Print” in Photoshop, and you just ……sigh ? Because your crafted masterpiece comes out looking nothing like it did on screen?. The colors got all faded, lines got fuzzy, and sometimes the </span><a href=\"https://www.procolored.com/collections/dtf-printer\"><span style=\"font-size:25px;\"><u>DTF transfer</u></span></a><span style=\"font-size:25px;\"> just flops. The real culprit is probably not your art skills failing you. Nine times out of ten, it’s your printer setup throwing shade.</span></p><p>&nbsp;</p><p><span style=\"font-size:25px;\">People seriously underestimate how much your printer choice actually matters. Like, it’s not just a box that spits out paper—it’s the gatekeeper of your colors, your sharpness, the actual feel of your design. Choose the wrong one, and your work gets ruined.</span></p><p>&nbsp;</p><p><span style=\"font-size:25px;\">And when it comes to DTF (Direct-to-Film) printing, the pressure is even higher. Compared to regular paper printers, DTF printers need you to tweak settings in Photoshop just so, or else all those crispy details and bold pops of color you worked for go straight down the drain.&nbsp;</span></p><p>&nbsp;</p><p><span style=\"font-size:25px;\">No joke, if you nail it, your </span><a href=\"https://www.procolored.com/collections/dtf-printer\"><span style=\"font-size:25px;\"><u>DTF transfers</u></span></a><span style=\"font-size:25px;\"> look like a pro did them—vivid, smooth, and tough as nails. But mess it up, and you’re just wasting ink, film, and probably yelling at your screen.</span></p><p>&nbsp;</p><p><span style=\"font-size:25px;\">So, what’s the deal with picking a DTF printer in Photoshop CC? Lemme break it down for you.</span></p>",
        "gg5BRuajkk9_text": "1.Resolution&nbsp;",
        "gg63jb6oDhy_text": "<p>1.Printer’s Missing in Action</p>",
        "gg7t8XD2gFv_text": "<p>Think of ICC profiles like the ultimate color matchmaker. It dictates precisely how the printer should execute the color reproduction. Without it your reds might turn into “mystery brown” and nobody wants that. Pick the profile that matches your printer, your film, and your ink, or risk rolling the dice every time you print.</p>",
        "gg91voz-tDi_text": "<p>2.Color Looking Dull</p>",
        "ggB7wEPxHQ3_errorMessage": "Can’t send email. Please try again later.",
        "ggB7wEPxHQ3_successMessage": "Thanks for contacting us. We'll get back to you as soon as possible.",
        "ggC_kKO9rgD_text": "<p>Table of Contents</p>",
        "ggCzXY_IT0i_text": "<p><a href=\"https://www.procolored.com/blogs/news/dtg-printing-101-the-top-10-faqs\" target=\"_blank\">DTG Printing 101: The Top 10 FAQs</a></p>",
        "ggE0cGiBi_9_text": "<p><span style=\"font-size:25px;\">Before you get all hyped up about printing down those eye-popping DTF prints, you gotta know your way around Photoshop CC’s print settings. It’s not rocket science, thankfully—once you know where to look.</span></p><p>&nbsp;</p><p><span style=\"font-size:25px;\">So, to start just press File up top, then press Print. Now, you entered the Photoshop Command centre. It has its collection of tools for you to control the print outs. Inside that Print Dialog Box, a few things are actually worth your attention:</span></p><p>&nbsp;</p><p><span style=\"font-size:25px;\">●<strong>Printer Dropdown</strong> – That’s where all your connected printers show up. If you’ve done the installation right, your </span><a href=\"https://www.procolored.com/collections/dtf-printer\"><span style=\"font-size:25px;\"><u>DTF printer</u></span></a><span style=\"font-size:25px;\"> will be here. Just tap your model before going ahead.</span></p><p><span style=\"font-size:25px;\">●<strong>Layout Preview</strong> – This is your personal test window. As the name suggests, it displays exactly how the design is placed in relation to the film or paper, thus allowing you to change placement, angle, and scaling prior to any print.</span></p><p><span style=\"font-size:25px;\">●<strong>Color Management Options</strong> – Here you decide on who will handle the color translation—Photoshop, or your printer? If you’re doing DTF printing, trust Photoshop to use the proper ICC profile, and your colors should pop like they’re supposed to.</span></p><p><span style=\"font-size:25px;\">●<strong>Print Settings Presets</strong> – If you’re printing the same way, over and over, presets are a lifesaver. Set it once, save it, and stop re-entering everything. You can populate saved settings with just a click.</span></p><p>&nbsp;</p><p><span style=\"font-size:25px;\">Keep in mind that Photoshop only lists printers that actually exist on your system. If your DTF printer isn’t there in the dropdown, it probably means the drivers are missing or your cable’s loose (yeah, it happens).</span></p>",
        "ggEPQo6haKu_text": "<p>Here’s where the magic happens, especially if you’re running a production DTF printing business. Photoshop can handle design, but when it comes to white ink layering, juggling multiple printers, or fine-tuning ink flow—you want RIP software on your team. It’s basically Photoshop’s friend that knows all the tricks. Put ’em together and you’ve got a setup that can keep up with the professionals.</p><p>&nbsp;</p><p><strong>Hot tip</strong>: Planning to scale up? Don’t cheap out—grab a decent RIP solution to go with Photoshop. Your <a href=\"https://www.procolored.com/collections/dtf-printer\"><u>DTF printer</u></a> (like that K8, or the Pro Series if you’re feeling fancy) will actually start living up to its potential.</p>",
        "ggHIuhNr32Q_text": "<p>Conclusion &amp; Next Steps</p>",
        "ggIlwzRbywK_text": "<a href=\"https://www.procolored.com/collections/dtf-printer\"><span style=\"font-size:25px;\"><u>DTF printing</u></span></a><span style=\"font-size:25px;\"> needs all the details hence the need for 300 DPI (dots per inch) is ideal for best results . At 300? Everything is crisp—lines, edges, the whole quality. Skimp on this, and you’ll see it all pixelated.</span><br><span style=\"font-size:25px;\">&nbsp;</span><br><span style=\"font-size:25px;\">But mind it the final sharpness also depends on your RIP software and printer resolution settings (e.g. 1440×1440).</span>",
        "ggJDFv88CAq_text": "<p>More Blogs About</p>",
        "ggKQcmm3ScK_text": "<p>Getting Familiar with Photoshop CC’s Print Settings</p><p><a href=\"#gL8z6U-23E\">The Role of the Printer in DTF Printing</a></p><p>Step-by-Step Guide: Selecting Your Printer in Photoshop CC</p><p>Optimizing Print Quality for DTF in Photoshop</p><p><a href=\"#gBaAJwGhKU\">&nbsp; &nbsp;&nbsp;</a>1. Resolution</p><p><a href=\"#gBaAJwGhKU\">&nbsp; &nbsp; 2. </a>Color Space</p><p><a href=\"#gBaAJwGhKU\">&nbsp; &nbsp; 3. ICC Color Profiles</a></p><p><a href=\"#gBaAJwGhKU\">&nbsp; &nbsp; 4. White Ink Layering</a></p><p>&nbsp; &nbsp; 5.<a href=\"#gBaAJwGhKU\">File Formats</a></p><p>Common Issues &amp; Troubleshooting</p><p>&nbsp; &nbsp;1. Printer’s Missing in Action<br>&nbsp; &nbsp;2. Color Looking Dull<br>&nbsp; &nbsp;3. White Ink Not Appearing</p><p>&nbsp; 4. File Not Fitting The Film</p><p>Advanced Tips for Professionals<br>&nbsp; <a href=\"#gy4ToHucG0\">1. Save Custom Print Presets</a><br>&nbsp;<a href=\"#gy4ToHucG0\">2. Use Smart Objects for Resizing</a><br>&nbsp;<a href=\"#gy4ToHucG0\">3. Create Print Templates</a><br>&nbsp;<a href=\"#gy4ToHucG0\">4. Pair Photoshop with RIP SoftwareoHucG0</a></p><p><a href=\"#gy4ToHucG0\">Conclusion &amp; Next Steps</a></p>",
        "ggKeQZq_wli_text": "<p>4.File Not Fitting The Film</p>",
        "ggLboDUr1B__text": "3.ICC Color Profiles",
        "ggMySI1SnL__text": "<p>Have you ever got a file from a client that needs resizing? Here’s the move: Convert those layers into a Smart Object. Now you can stretch, shrink, or flip your design and not compromise on print quality. Trust us, for DTF printing, it's a bonus.. That way your designs don’t turn into a blurry mess when you go from tiny logo to billboard-size T-shirt print.&nbsp;</p>",
        "ggOl_FHeSLN_text": "<p>2.Use Smart Objects for Resizing</p>",
        "ggPrg_gtXV__text": "<p>3.Create Print Templates</p>",
        "ggS6nUWh9es_text": "<p><span style=\"font-size:25px;\">Honestly, not all printers are up to the task—especially if you’re diving into DTF printing. You can’t just grab your old office inkjet or some dusty laser printer and expect crisp, pro-level transfers. That’s a one-way ticket to frustration, trust me.</span></p><p>&nbsp;</p><p><span style=\"font-size:25px;\">Here’s why your basic printer just can’t hack it for DTF:</span></p><p><span style=\"font-size:25px;\">●The ink’s all wrong—regular ink just slides off DTF film or, worse, makes your design look like it got caught in a rain.</span><br><span style=\"font-size:25px;\">●These printers are built to work with standard &nbsp;paper and do not support specialized DTF films as media. As such, they are likely to either jam or not print at all.</span><br><span style=\"font-size:25px;\">●And color? Forget it. Standard printers just can’t pull off those vibrant colors DTF needs. Your neon pink dream? Not possible.</span></p><p>&nbsp;</p><p><span style=\"font-size:25px;\">Now, a legit DTF printer from Procolored? That’s a whole different setup. They’re built for this. We’re talking:</span></p><p><span style=\"font-size:25px;\">●Thick, even layers of white ink, so your designs actually pop on dark shirts instead of fading into the void.</span><br><span style=\"font-size:25px;\">●Way better color range. Every gradient, every shade, every little detail—nailed.</span><br><span style=\"font-size:25px;\">●The print actually sticks and doesn’t wash away after two trips through the laundry. Durability for the win.</span></p><p>&nbsp;</p><p><span style=\"font-size:25px;\">Look, you can whip up a killer design in Photoshop all day long, but if you run it through the wrong printer, it’s like putting cheap gas in a Ferrari.</span></p><p>&nbsp;</p><p><span style=\"font-size:25px;\">You want your stuff to look sharp and last? Get yourself a real DTF printer. Don’t cut corners—you’ll just regret it.</span></p>",
        "ggSQvvZE9DI_text": "<p>4.White Ink Layering</p>",
        "ggT9L60BwFg_text": "<p>DTF newbies always freak out about this. You print, and the white parts just… disappear. Not cool, especially if you’re working with dark tees. Make sure your printer’s actually set to use white ink. This White ink layers must be created and managed through RIP software—Photoshop alone cannot control white ink printing. Ensure your RIP software is properly configured for white ink.</p>",
        "ggViHNW-RMW_text": "<p>Look, if you’re printing the same shirt placement fifty times, don’t torture yourself. Make a Photoshop template. Set up your artboards, drop in some positioning guides, lock in your usual print settings. Next time, just drop in the new artwork and hit print. It’s like meal-prepping, but for shirts.</p>",
        "ggXVyTcVVK3_text": "Subscribe",
        "ggZh3Z54tpd_text": "<p>To join our mailing list</p><p>and never miss our updates !</p>",
        "ggZoq3fmi0i_text": "<p>PNG is useful for transparency, but TIFF, PSD, or PDF files are also widely used in <a href=\"https://www.procolored.com/collections/dtf-printer\"><u>DTF printing</u></a> for preserving detail and layers. This makes sure that your designs don’t come with those ugly rectangles or random backgrounds. Saves you a headache and keeps everything looking pro when you transfer.</p><p>&nbsp;</p><p><strong>Pro Tip</strong>: Triple-check your settings before you hit print.. Nailing the DPI, ICC profile, and white ink makes the difference between “meh, that’s okay” and “holy crap, did YOU make that?”</p>",
        "gg_9PdIVGz-_placeholder": "Email",
        "ggaE68rFUUZ_text": "<p>Here’s the DTF trick: white ink. It’s the magic that makes colors stand out, especially on dark shirts. If your printer can’t handle white ink layering properly, you’ll end up with washed-out colors that look straight-up depressing. Get a DTF printer that actually knows what it’s doing with white.</p>",
        "ggadDawpkbm_text": "<p>Most Popular Blogs</p>",
        "ggbxye-NCZR_label": "Subscribe Now",
        "ggdiPJqiEx2_text": "<p>Getting Familiar with Photoshop CC’s Print Settings</p>",
        "gge6QwFYvlI_text": "<p>Common Issues &amp; Troubleshooting</p>",
        "ggfCTw7ukaD_text": "<p>Advanced Tips for Professionals</p>",
        "gghEbFESl_2_text": "<p><span style=\"font-size:25px;\">Keep your design in RGB in Photoshop, but make sure your settings don’t conflict with your RIP software, which will handle the RGB-to-CMYK conversion for printing.</span></p>",
        "gghbZCoKGkX_text": "2.Color Space",
        "ggieIapYLIq_text": "<p>1.Save Custom Print Presets&nbsp;</p>",
        "ggjOvgMFJe2_text": "<p><span style=\"font-size:25px;\">Once you’ve got your design looking awesome in Photoshop, send it to the DTF printer to put it onto some </span><a href=\"https://www.procolored.com/collections/dtf-printer\"><span style=\"font-size:25px;\"><u>DTF film</u></span></a><span style=\"font-size:25px;\">. Here’s how you should be doing it the right way.</span></p><p>&nbsp;</p><p><span style=\"font-size:25px;\">1.First up, open your artwork in Photoshop. Make sure it’s high-res—like, 300 DPI.&nbsp;</span><br><span style=\"font-size:25px;\">2.Now, <strong>Go to File &gt; Print</strong>. &nbsp;Print dialog pops up where you’ve all the controls.</span><br><span style=\"font-size:25px;\">3.Look for your DTF printer in the dropdown. If you’re using something like the Procolored F13 Pro DTF Printer, it should show up if you installed it properly (if not, well, that’s your cue to fix it).</span><br><span style=\"font-size:25px;\">4.Settings time! Don’t just ignore it—this stuff matters:</span></p><p>&nbsp;</p><p><span style=\"font-size:25px;\">●<strong>Media type</strong>: If DTF film is an option, pick it. If not, create a custom setting close enough to the type of your film</span><br><span style=\"font-size:25px;\">●<strong>Print quality</strong>: Design your artwork at 300 DPI in Photoshop for best results, but final sharpness also depends on your RIP software and printer resolution settings (e.g. 1440×1440).</span><br><span style=\"font-size:25px;\">●<strong>Layout</strong>: You want it centered? Full-size? Or scale it to fit your film</span><br><span style=\"font-size:25px;\">●<strong>Color handling</strong>: Set up your color management in Photoshop with the right ICC profile, but remember: DTF printing requires RIP software to properly generate the white ink layer and manage the print order.</span></p><p>&nbsp;</p><p><span style=\"font-size:25px;\">Before you go on that print button, check the preview! Seriously, peek at the alignment, scaling, and colors. If you skip this, you’ll waste film and ink faster and your wallet will curse you.</span></p><p>&nbsp;</p><p><span style=\"font-size:25px;\">That’s pretty much it. The rest is just crossing your fingers and hoping the printer’s in a good mood today. Good luck!</span></p>",
        "ggkTUmfTeRQ_text": "<p><a href=\"https://www.procolored.com/blogs/news/how-to-achieve-premium-results-in-digital-specialty-printing\" target=\"_blank\">How to Achieve Premium Results in Digital Specialty Printing</a></p>",
        "ggl0swhcsJb_text": "<p>Getting killer prints outta Photoshop CC? It’s not just clicking around and hoping for the best. You need the right setup—and honestly, your printer’s gotta be up for the job too.</p><p>&nbsp;</p><p>Photoshop is your playground. Go wild—tweak your resolution, play with colors, try out funky layouts, whatever. But here’s the thing: your fancy digital masterpiece is only as good as the printer you feed it to. The printer’s the one that decides if your work ends up looking like gallery material or something you’d rather shove in a drawer.</p><p>&nbsp;</p><p>Especially with DTF printing, the printer configuration and setup is critical in transforming a good design into a bold, durable, and professional-quality transfer. It is appropriate to consider Photoshop the creative brain and the DTF printer the muscle that pulls everything together.</p><p>&nbsp;</p><p>So, if you’re tired of your prints looking like sad, faded knock-offs, maybe it’s time for an upgrade. Our DTF printers play super nice with Photoshop CC—think punchy colors, razor-sharp details, and studio-worthy results, every single time. No more guesswork, just pro-level prints.</p><p>&nbsp;</p><p>Ready to stop settling for “good enough”? Step it up with <a href=\"https://www.procolored.com/\"><u>Procolored</u></a> DTF printers. We make Photoshop printing super easy, ridiculously precise, and about as professional as you can get without actually hiring a studio. Go on—give your workflow the glow-up it deserves.</p>",
        "ggmUhtrmvga_text": "<p>So your <a href=\"https://www.procolored.com/collections/dtf-printer\"><u>DTF printer</u></a> isn’t showing in the Photoshop print menu? Nine times out of ten, it’s the drivers—or the connection is not recognized. Double-check that USB, re-check your WiFi, whatever. Then, grab the latest driver for your printer model and put it on your system. Usually, once that’s sorted, Photoshop finds your printer.</p>",
        "ggnSXXQu6tW_text": "<p>Step-by-Step Guide: Selecting Your Printer in Photoshop CC</p>",
        "ggnZUBM9u6l_text": "<p>Design’s too big, too small, or got the edges chopped? Classic scaling problem. Pop open the print preview in Photoshop, hit “Fit-to-Media,” or just manually see the scale setting until it actually fits the film. Don’t trust the default—Photoshop may betray you.</p><p>&nbsp;</p><p>⚡ <strong>Quick hack</strong>: Make a mini checklist before you print—connection, drivers, ICC profiles, scaling. Seriously, if you nail those four, you dodge like 90% of DTF printing headaches.</p>",
        "ggoeupCYnxu_text": "<p>So you’ve got the hang of basic Photoshop printing?—great. Now let’s level it up. If you’re crafting out DTF prints for a shop or dealing with a million client orders, these tricks are gonna save you.</p>",
        "ggpBRlsvkqE_text": "<p>Nothing like spending hours on a design only for it to print out looking flat and less vibrant. That’s almost always a color management issue. Double-check your ICC profiles—those are the magic translators between Photoshop and your printer. If they’re missing, your colors are gonna look like they died. Fix that, and your prints start popping again.</p>",
        "ggq61o4w_jG_text": "<p><span style=\"font-size:25px;\">Picking your printer is just the warm-up act, honestly. The real work starts when you dive into your print settings. DTF printing is all about those tiny adjustments—it can distinguish between an exquisite and a lacking transfer. Here’s what to keep in mind:</span></p>",
        "ggsAyHhai1Z_text": "<p>The Role of the Printer in DTF Printing</p>",
        "ggt7mAZ3qkE_text": "<p>4. Pair Photoshop with RIP Software&nbsp;</p>",
        "ggtfPp7M6vA_text": "<p><a href=\"https://www.procolored.com/blogs/news/tagged/industry-trends\" target=\"_blank\">industry trends</a></p><p><a href=\"https://www.procolored.com/blogs/news/tagged/maintenance\" target=\"_blank\">maintenance</a></p><p><a href=\"https://www.procolored.com/blogs/news/tagged/newsroom\" target=\"_blank\">newsroom</a></p><p><a href=\"https://www.procolored.com/blogs/news/tagged/product-showroom\" target=\"_blank\">product showroom</a></p><p><a href=\"https://www.procolored.com/blogs/review\" target=\"_blank\">printer review</a></p>",
        "ggyo8sQEaoC_text": "<p>5.File Formats</p>"
      },
      "type": "gp-section-592155965848158750"
    }
  },
  "order": [
    "gp_section_592155965848093214",
    "gp_section_592155965848158750",
    "gp_section_592155965848027678"
  ]
}
