/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "gp_section_592178822825116190": {
      "settings": {
        "checksum": "3f68578bae276043af755376cf5974391b34eaa3447ab82124baac37c3e30ccc_1_1_1_0__1",
        "gg3T0U2BKEg_placeholder": "Email",
        "gg8m8kfovaa_text": "<p>Most Popular Blogs</p>",
        "ggA3Psqznfl_text": "<p>More Blogs About</p>",
        "ggJTO0OA8nf_text": "<p><a href=\"https://www.procolored.com/blogs/news/tagged/industry-trends\" target=\"_blank\">industry trends</a></p><p><a href=\"https://www.procolored.com/blogs/news/tagged/maintenance\" target=\"_blank\">maintenance</a></p><p><a href=\"https://www.procolored.com/blogs/news/tagged/newsroom\" target=\"_blank\">newsroom</a></p><p><a href=\"https://www.procolored.com/blogs/news/tagged/product-showroom\" target=\"_blank\">product showroom</a></p><p><a href=\"https://www.procolored.com/blogs/review\" target=\"_blank\">printer review</a></p>",
        "ggL_fqYDx2B_text": "<p><a href=\"https://www.procolored.com/blogs/news/how-to-achieve-premium-results-in-digital-specialty-printing\" target=\"_blank\">How to Achieve Premium Results in Digital Specialty Printing</a></p>",
        "gght-PoKUCn_text": "<p><a href=\"https://www.procolored.com/blogs/news/dtg-printing-101-the-top-10-faqs\" target=\"_blank\">DTG Printing 101: The Top 10 FAQs</a></p>",
        "ggmuwu3zLKJ_text": "Subscribe",
        "ggnC8UooLBr_text": "<p>To join our mailing list</p><p>and never miss our updates !</p>",
        "ggnEUcSVXBt_text": "<p><span style=\"font-size:15px;\">Simon has worked in inkjet printing industry for years. &nbsp;He has the rare ability to see print related issues from many perspectives. Witnessing the gradual development of digital printing especially inkjet printing, Simon knows better about what the users are looking for and how the new technologies will truly help big or small businesses.</span></p>",
        "ggpAvqpSmHh_errorMessage": "Can’t send email. Please try again later.",
        "ggpAvqpSmHh_successMessage": "Thanks for contacting us. We'll get back to you as soon as possible.",
        "ggphxxcq0Vn_label": "Subscribe Now",
        "ggw3ZXqMaf3_text": "<p><span style=\"font-size:16px;\"><i>About the Author - Simon</i></span></p>"
      },
      "type": "gp-section-592178822825116190"
    },
    "gp_section_592178822825181726": {
      "settings": {
        "checksum": "815a33ed9860673ee0b76c9be8ff88f4d2061f979250abec9d8b759dd3594063_1_1_1_0__1",
        "ggEDzZghpU2_text": "<p>Written by <span style=\"color:#050404;\">Procolored</span> - Published on&nbsp;<span style=\"color:#000000;\"> Oct. 25, 2025</span></p>",
        "ggVWrF204ov_text": "<p>Share:</p>",
        "gganByn9hBD_text": "<p>Share:</p>",
        "ggpYAD2j5Oa_text": "<p>9 minutes read</p>",
        "ggu-3SYG5mk_text": "How To Print Bulk Orders Of Custom t shirts at Minimum Cost&nbsp;",
        "ggwkC-T9ZoM_text": "<p>9 minutes read</p>",
        "ggz_Tut7WFk_text": "<p>Written by <span style=\"color:#050404;\">Procolored</span> - Published on <span style=\"color:#000000;\">Sept 27, 2025</span></p>",
        "section_preload": "true"
      },
      "type": "gp-section-592178822825181726"
    },
    "gp_section_592178822825247262": {
      "settings": {
        "checksum": "94286ca696cb1a8e6726b5b7eafdbd1529ae974a16fd92748f1ce809ee63f1d9_1_1_1_0__1",
        "gg-foN2quOY_text": "<p>With a lotta printing methods out there, the more you want, the more they bleed you dry. But, Procolored doesn’t play that game. Whether it’s bulk shirts of ten pieces or a thousand, the price per shirt doesn’t creep up. No mysterious “setup” charges, no “threshold pricing” nonsense. Just steady, predictable costs, so you can actually plan for once.</p>",
        "gg00OHayhpN_text": "<span style=\"font-size:20px;\"><strong>3. Labor vs. Automation</strong></span>",
        "gg0jkhZ0rtF_text": "<p>Bulk orders t shirts come with a tight deadline, and down time here is enemy number one. Procolored DTF printers offer the edge of automated cleaning systems to constantly keep the nozzles clean and ready to print, which means you find yourself not fidgeting, and not clogging expensive nozzles that costs you time!</p>",
        "gg1nW0oH2cs_text": "<p>DTF has this beauty: You’ve got just one printer, and with that you can print a design on pretty much anywhere—cotton, poly, blends, hoodies, tote bags, whatever. No need to turn down that weird customer request for a customized t shirt order, and you don’t have to blow your budget on a separate machine for every fabric type. One t shirt printer, a million options. Pretty sweet deal.</p>",
        "gg46y7ZhIxy_text": "<p>Old-school bulk t shirt printing is basically gambling. You print a mountain of shirts, cross your fingers, and pray people actually buy them. Spoiler: they usually don’t, and you’re left with a sad stack of unsold tees hogging space in the shop.</p><p>&nbsp;</p><p>DTF is way too smart. Keep bulk blank shirts stored in the back, then print designs as orders come in—doesn’t matter if it’s one shirt or a hundred. So, you’re not spending cash on stuff nobody wants, and your storage room isn’t a graveyard for last season’s “hottest” design. Way less waste, way less cringe.</p>",
        "gg4titzD2Rt_text": "<p>4. Leverage Digital Inventory</p>",
        "gg4x74DfD4w_text": "<p>Printing customized-t-shirts in bulk quantities sounds like every printer jackpot. Right? Big orders = more money. At least that’s a dream.</p><p>&nbsp;</p><p>But—just ‘cause you’re printing bulk order t shirts doesn’t mean you’re paying less.</p><p>&nbsp;</p><p>Seriously, so many small businesses get into the trap of chasing bulk t shirts deals, only to watch their margins vanish—- thanks to sneaky setup fees, unsold piles of shirts gathering dust, or prints that start peeling after one wash.&nbsp;</p><p>&nbsp;</p><p>And honestly, most of this is caused by the “old-school trap” of screen printing. The pricing model on paper is tempting but for small businesses it becomes a disaster. Ironically, what seemed to be cheap ends up eating into profits.</p><p>&nbsp;</p><p>Now, here’s where things get interesting. The new digital-first approach—Direct-to-Film (DTF) printing—rewrites the profit formula. No expensive screens, no picky fabric nonsense, and forget about stockpiling a mountain of tees you might never sell.</p><p>&nbsp;</p><p>With DTF—especially if you’re using a Procolored <a href=\"https://www.procolored.com/collections/tshirt-printer\"><u>t shirt printer</u></a>—you can finally take on bulk order t shirts printing without those nightmare costs. Quality stays up, flexibility’s on point, and your profit actually sticks around for once.</p><p>&nbsp;</p><p>So, wanna know how to keep costs low, quality high, and your t shirt business running smoother than ever? Give this blog a read.</p>",
        "gg5cYpC08qs_text": "<p>The Profit Side: Turning Bulk t shirt Printing Into a Scalable Business</p>",
        "ggB7wEPxHQ3_errorMessage": "Can’t send email. Please try again later.",
        "ggB7wEPxHQ3_successMessage": "Thanks for contacting us. We'll get back to you as soon as possible.",
        "ggBRIs8kc1B_text": "<p><span style=\"font-size:20px;\"><strong>Built To Scale</strong></span></p>",
        "ggBcb8rByYZ_text": "<p><span style=\"font-size:20px;\"><strong>Print Once, Use Always</strong></span></p>",
        "ggC_kKO9rgD_text": "<p>Table of Contents</p>",
        "ggCzXY_IT0i_text": "<p><a href=\"https://www.procolored.com/blogs/news/dtg-printing-101-the-top-10-faqs\" target=\"_blank\">DTG Printing 101: The Top 10 FAQs</a></p>",
        "ggE0cGiBi_9_text": "<p>People always think bulk t shirts printing is just about t shirts and ink. That’s it. But for anyone who’s ever tried to pull off a big order (dozens, maybe hundreds) knows that’s a whole lot of process .</p><p>&nbsp;</p><p>There’s a bunch of expenses that sneak up on you—setup fees, storing piles of shirts, paying people to run the machines, and, oh, let’s not forget screwing up a batch and having to redo it.</p><p>&nbsp;</p><p>Let’s get into the nitty-gritty:</p>",
        "ggEtmIfWUum_text": "<p>Screen printing gets hyped as “super cheap.” Sure, until you realize every single design needs its own screen, plus a bunch of prep work. Add more colors into the mix and your “budget” order just got too expensive .</p><p>&nbsp;</p><p>Seriously, for small shops, these setup fees chew right through your profits before you even start bulk shirts printing..</p><p>&nbsp;</p><p>Now, <a href=\"https://www.procolored.com/collections/dtf-printer\"><u>DTF printing</u></a> is a total game-changer. Grab yourself a Procolored DTF printer, and luckily—no custom plates, no screens, no stupid minimums. Wanna print 3 shirts? Cool. Wanna print 500? Also cool. Just open it up and print what you need, when you need it. No fuss.</p>",
        "ggGAYiYheEs_text": "<span style=\"font-size:20px;\"><strong>DTF (Direct-to-Film) with Procolored</strong></span>",
        "ggJDFv88CAq_text": "<p>More Blogs About</p>",
        "ggKQcmm3ScK_text": "<p>The Real Cost Equation (It’s More Than Ink and Shirts)<br>1. The Hidden Setup Costs Behind Cheap Bulk T Shirts<br>2. Inventory Headaches<br>3. Labor vs. Automation<br>4. Mistakes &amp; Reprints<br>DTF vs. The Rest: Why It’s the Smart Choice for Bulk T Shirts Printing<br>Screen Printing<br>Vinyl Heat Transfer<br>Sublimation<br>DTF (Direct-to-Film) with Procolored<br>The Procolored Advantage: Why These DTF Printers Slash Bulk t shirt Printing Cost?<br>Print Once, Use Always<br>Ink Efficiency Tech<br>24/7 Reliability<br>Colors Accuracy Across Orders<br>Built To Scale<br>Pro Tips for Custom Bulk t shirt Printing at Rock-Bottom Costs<br>1. Gang Sheet Printing<br>2. Batch Heat Pressing<br>3. More Fabrics, Still One Printer<br>4. Leverage Digital Inventory<br>5. Quick Maintenance Trick<br>The Profit Side: Turning Bulk t shirt Printing Into a Scalable Business<br>Future-Proofing With Procolored DTF<br>Conclusion</p>",
        "ggL3JcE4wm9_text": "<p>And then comes DTF—the game-changer. With Procolored DTF printers, it's ridiculously easy: one film prints on any fabric, any color, any order size. Cotton tees, polyester polos, hoodies, tote bags—you name it.</p><p>&nbsp;</p><p>Even better still, your design library is like a virtual warehouse. Store your files, print at will, no setup charges, no time wasted. Whether 50 tees or 500, you produce the same silky, uniform results.</p><p>&nbsp;</p><p>So next time when somebody hits you with, “<i>Where to buy shirts in bulk?</i>”—just smile. Because with Procolored, you’re not out shopping just for customized-t-shirts—you’re building a brand that handles bulk order t shirts like a pro.</p>",
        "ggLdmBJK2HW_text": "<p><span style=\"font-size:20px;\"><strong>24/7 Reliability</strong></span></p>",
        "ggMd5Nz2bQH_text": "<p>Be mindful that bulk t shirt printing isn’t just some smart move to save a few bucks. It’s about fattening up those profit margins and actually building something that grows, not just limps along paycheck to paycheck.</p><p>&nbsp;</p><p>Here, a Procolored t shirt printing machine flipped the game. With them, you’re not stuck begging for the mega-orders just to keep the lights on.&nbsp;</p><p>&nbsp;</p><p><strong>Say your neighborhood café wants a custom bulk order t shirt for 50 pieces for their team—you can say yes and still make some cash.</strong></p><p>&nbsp;</p><p><strong>Then, outta nowhere, a bigger corporate client drops a bulk shirts of 2,000-piece? No problem. You’ve got the speed to handle it without losing your mind (or your weekend).</strong></p><p>&nbsp;</p><p>And don’t even get me started on versatility. You’re not locked into just churning out t shirts like some printing robot. Nope. Same printer, same setup—can let you crank out hoodies, totes, hats, you name it.</p><p>&nbsp;</p><p>Didn’t have to blow a bunch of cash on extra gear, either. One printer, a bunch of new ways to make money, and your overhead doesn’t move an inch.</p><p>&nbsp;</p><p>That’s how you level up <strong>bulk t shirts printing</strong> from just scraping by to running a shop that actually grows—and, yeah, keeps your wallet happy.</p>",
        "ggR1ites0UD_text": "<p>3. More Fabrics, Still One Printer</p>",
        "ggSGp2AHSWI_text": "<p><strong>&nbsp;</strong>If you're serious about printing custom bulk t shirts without your budget crying for help then Procolored DTF printers for shirts are the way to go.. They are packed with sneaky little features that’ll save you from those “hidden cost” nightmares, help you hustle faster, and basically make your print sharp.</p><p>&nbsp;</p><p>Let’s dig into why dropping cash on one isn’t just a splurge—it’s smart.</p>",
        "ggSzHjq7K9m_text": "<p><span style=\"font-size:20px;\"><strong>1.Gang Sheet Printing</strong></span></p>",
        "ggVSbb6r7tS_text": "<p>The print world has flipped altogether. Remember when “bulk order t shirts” meant blasting out one boring design on thousands of t shirts and just crossing your fingers they’d move? Yeah, that ship’s sailed. Today, people want options—like, endless design with no extra costs.</p><p>&nbsp;</p><p>So, here’s the cheat code: Procolored t shirt printers. They let you perform</p><p>●<strong>On-Demand + Bulk Hybrid Is The New Normal</strong><br>Brands are chasing quick turnarounds, tiny batches, and wild design swaps without needing to pay extra.</p><p>●<strong>Micro-bulk orders = No Problem</strong><br>Let’s say someone wants 100 tees each for 10 separate designs. Old-school printers would groan. But DTF doesn’t even blink. Price stays the same as if you’d just printed one giant stack of the same thing. Magic.</p><p>●<strong>Flexibility = Future Profits</strong></p><p>&nbsp;</p><p>Forget gambling on massive orders that might flop. DTF means you can say “sure, why not?” to pretty much any client, anytime. No more all-or-nothing.</p><p>&nbsp;</p><p>So, long story short: grab a Procolored <a href=\"https://www.procolored.com/collections/tshirt-printer\"><u>t shirt printer</u></a> in your shop and you’re basically future-proof. Whether you’re pumping out thousands or spinning plates with a bunch of small-batch gigs, you’re set.</p>",
        "ggVu7B_E8v8_text": "<p>Know that white ink is usually the wallet assassin in the DTF world. But the Procolored DTF Printer for shirts has this clever circulation system that keeps things moving, so you’re not just tossing money down the drain with every print.</p>",
        "ggXKyO0fH0y_text": "<p>One of the best hacks here is flexibility. With a Procolored <a href=\"https://www.procolored.com/collections/dtf-printer\"><u>DTF printing machine</u></a>, you can bang out a bunch of transfers in advance, stash ‘em away, and just heat press whenever the orders roll. This implies that you can complete reorders in a matter of minutes or prepare for large assignments ahead of time. If you’re doing bulk t shirt printing, it’s pretty much a sanity-saver.</p>",
        "ggXVyTcVVK3_text": "Subscribe",
        "ggXgmpXipgu_text": "<p>Lets be real, the more steps you pile on, the more people you need (and, let’s be honest, the more cash you’re burning through). Screen printing is a whole production—setting up, lining everything up just right, and then there’s all that hands-on work. More people, more money out the door.</p><p>&nbsp;</p><p>Now, Procolored DTF printers are basically plug and play. Hit print, slap it on the shirt, press, and boom—you’re done. You barely have to babysit the thing. It spits out bulk t shirts way faster and saves you a ton of stress, especially when the clock’s ticking.</p>",
        "ggZh3Z54tpd_text": "<p>To join our mailing list</p><p>and never miss our updates !</p>",
        "ggZt0DJKqt5_text": "<p>Gang sheet printing is like a carpooling system but with designs. Rather than wasting resources on a single design, you can easily stack as many logos, graphics, and designs as possible onto one sheet.</p><p>&nbsp;</p><p>The best part is that the Procolored DTF Printing machine allows you to do this. Their ample printing area guarantees that every corner of the sheet is used, increasing the savings per print.</p>",
        "gg_9PdIVGz-_placeholder": "Email",
        "ggadDawpkbm_text": "<p>Most Popular Blogs</p>",
        "ggaz-KLLNhJ_text": "<p>Old school is practically ancient. It’s the boss if you’re cranking out 10,000 shirts for some mega-corporate event. They love that stuff. But if you’re a small business or you just need, like, a couple hundred customized-t-shirts? Forget it.</p><p>&nbsp;</p><p>Every time you want to add a new color, you need to shell out for another screen and more setup. The costs stack up faster than you can imagine and that “cheap” bulk t shirt orders no longer remain cheap.</p>",
        "ggbPB7ePVgp_text": "<p>Why drown in stacks of unsold shirts? Seriously, stop. With DTF, your “inventory” lives on your hard drive. Somebody wants a reorder? Dig out the file, hit that print button, and you’re done. No more screens, no extra setup, zero headaches. Repeat bulk order t shirt just became your new favorite thing—faster, smoother, and you actually make more money.</p>",
        "ggbxye-NCZR_label": "Subscribe Now",
        "ggda8edweHm_text": "<p>Bulk order t shirt won't have to exhaust your resources or your budget. The key is being able to extract every ounce of efficiency from your workflow—and that gets way easier when you’ve got the right habits (and the right tools, like Procolored <a href=\"https://www.procolored.com/collections/tshirt-printer\"><u>t shirt printers</u></a>) on your side.</p><p>&nbsp;</p><p>Below are some advanced methods to reduce your costs while increasing productivity.</p>",
        "ggdiPJqiEx2_text": "<p><span style=\"font-size:20px;\">The Real Cost Equation (It’s More Than Ink and Shirts)</span></p>",
        "gge1Wur7L1X_text": "<p>5.Quick Maintenance Trick</p>",
        "ggeAT7s12HS_text": "<span style=\"font-size:20px;\"><strong>4.Mistakes &amp; Reprints</strong></span>",
        "ggeoLEoilod_text": "<span style=\"font-size:20px;\"><strong>2. Inventory Headaches</strong></span>",
        "ggfQ6x-J1mE_text": "<span style=\"font-size:20px;\"><strong>Screen Printing</strong></span>",
        "gggdkTC3be8_text": "<p><span style=\"font-size:20px;\">The Procolored Advantage: Why These DTF Printers Slash Bulk t shirt Printing Cost?</span></p>",
        "ggh7ibBaHiW_text": "<p>You know how some printers have commitment issues with color? Not Procolored. No matter if you’re running a batch now or dropping another bulk shirt order months later, your reds stay red, your blues won’t bail, and that corporate logo? &nbsp;Stays exactly the same in every shirt, every time.</p>",
        "gghbZCoKGkX_text": "<span style=\"font-size:20px;\">DTF vs. The Rest: Why It’s the Smart Choice for Bulk T Shirts Printing</span>",
        "gghjN40_V_8_text": "<p>The truth is, old-school bulk t shirt printing used to feel like running a marathon on flip-flops—slow, and way too costly. Screen setup drained your wallet, vinyl sucked up your hours and sublimation boxed you in polyester prison.</p><p>&nbsp;</p><p>But Procolored t shirt printers are a whole different vibe. Bulk shirts suddenly stop being a pain and actually get… fun? Yeah</p><p>&nbsp;</p><p>✅ Forget those setup nightmares eating your margins<br>✅ One machine, whatever you wanna print on—t shirts, hats, neon pink hoodies, you name it<br>✅ The more you print, the better your margins get (which, let’s be honest, is the dream)<br>✅ Built to crush the deadline without any clogging.</p><p>&nbsp;</p><p>So, are you gonna keep wrestling with the old methods, or wanna print where bulk order t shirts are lean, fast and huge on the profit? With a <a href=\"$locationOrigin/\"><u>Procolored</u></a><u> </u>DTF printing machine, the choice is kinda obvious.</p>",
        "ggi-m__gkIF_text": "<p><span style=\"font-size:20px;\"><strong>Ink Efficiency Tech</strong></span></p>",
        "ggiXpwwCqoN_text": "<p>When you get into bulk t shirts printing, you get to see a lot of ways. Though they appear better on paper than they actually are. Let’s have a view on them.</p>",
        "ggi_YlKsFu6_text": "<p><span style=\"font-size:20px;\"><strong>Colors Accuracy Across Orders</strong></span></p>",
        "ggjgD5IM69L_text": "<p>Nothing wrecks your day (and your profits) faster than a clogged printer head. Here’s the good news: Procolored DTF printing machines have this auto-clean cycle. Just run it after each batch. Two minutes, done. You dodge the ink wastage, skip the downtime, and your printer sticks around way longer. Trust me, it’s the laziest way to save yourself from a pile of hassle.</p>",
        "ggkTUmfTeRQ_text": "<p><a href=\"https://www.procolored.com/blogs/news/how-to-achieve-premium-results-in-digital-specialty-printing\" target=\"_blank\">How to Achieve Premium Results in Digital Specialty Printing</a></p>",
        "ggluDYDpXSH_text": "<p>Seems cheap at first, right? Spoiler: it’s not. Sure, materials don’t cost much, but the labor work is brutal. You’re stuck cutting, peeling, pressing, repeating—by the hundred. If you value your time, vinyl heat transfer for bulk jobs is basically self-inflicted torture. Fine for the odd shirt or two, but for real volume, it's a hard pass.</p>",
        "ggm8U6zgO6d_text": "<p>One tiny slip—wrong screen, off-color, whatever—in old-school printing and, well, there goes a chunk of your batch straight to the “wasted” pile. That’s cheap blank t shirts, ink, and precious time right down the drain.</p><p>&nbsp;</p><p>DTF is a whole different game. Each transfer comes out clean and identical, every single time. No nasty surprises halfway through your run. You end up with way less waste, and honestly, your wallet’s gonna thank you.</p>",
        "ggnkPpG2SlV_text": "<span style=\"font-size:20px;\"><strong>Sublimation</strong></span>",
        "ggoCa0Ce-SN_text": "<span style=\"font-size:20px;\"><strong>1. The Hidden Setup Costs Behind Cheap Bulk T Shirts</strong></span>",
        "ggtNVUdsZPj_text": "<p>Looks gorgeous—no doubt. The colors pop like crazy, the prints are buttery smooth—it’s like magic. Then you realize it only works on polyester. So, yeah, no cotton t shirts, no hoodies, no canvas tote bags—nothing.</p><p>&nbsp;</p><p>Unless your entire customer base is obsessed with synthetic fabrics, sublimation’s a massive letdown for bulk order t shirts. Cool tech, but can’t play the bulk game.</p>",
        "ggtfPp7M6vA_text": "<p><a href=\"https://www.procolored.com/blogs/news/tagged/industry-trends\" target=\"_blank\">industry trends</a></p><p><a href=\"https://www.procolored.com/blogs/news/tagged/maintenance\" target=\"_blank\">maintenance</a></p><p><a href=\"https://www.procolored.com/blogs/news/tagged/newsroom\" target=\"_blank\">newsroom</a></p><p><a href=\"https://www.procolored.com/blogs/news/tagged/product-showroom\" target=\"_blank\">product showroom</a></p><p><a href=\"https://www.procolored.com/blogs/review\" target=\"_blank\">printer review</a></p>",
        "gguHF5YSpEj_text": "<p><span style=\"font-size:20px;\">Conclusion</span></p>",
        "ggvHGQFcui4_text": "<p><span style=\"font-size:20px;\">Pro Tips for Custom Bulk t shirt Printing at Rock-Bottom Costs</span></p>",
        "ggvpH8MRvFe_text": "<p><span style=\"font-size:20px;\">Future-Proofing With Procolored DTF</span></p>",
        "ggxGiUZkmHH_text": "<p>2.Batch Heat Pressing</p>",
        "ggxOCv9QN_f_text": "<p>Batch heat press t shirts allow you to save both money and time. Instead of pressing one shirt at a time and repeating the process, you can organize your workflow from a single shirt to several and do them in batches.</p><p>&nbsp;</p><p>Group shirts in accordance to their size, color, and even their design and you are sure to save time. Once the transfers are printed, the workflow becomes a smooth process and allows for the time to be cut down significantly.</p>",
        "ggxd2et8iir_text": "<p><span style=\"font-size:20px;\"><strong>Vinyl Heat Transfer</strong></span></p>"
      },
      "type": "gp-section-592178822825247262"
    }
  },
  "order": [
    "gp_section_592178822825181726",
    "gp_section_592178822825247262",
    "gp_section_592178822825116190"
  ]
}
