/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "breadcrumbs": {
      "type": "breadcrumbs",
      "settings": {}
    },
    "template-header": {
      "type": "template-header",
      "settings": {
        "show_collection_image": false,
        "show_collection_description": true,
        "show_subcollections": true,
        "color_subcollection_bg": "#ffffff",
        "color_subcollection_text": "#303c43",
        "display_description": true
      }
    },
    "product-grid": {
      "type": "main-collection-product-grid",
      "settings": {
        "products_per_page": 12,
        "columns_desktop": 3,
        "pagination_type": "paginated",
        "enable_filtering": true,
        "enable_sorting": true,
        "show_counts": true,
        "filter_color_swatches": true,
        "facets_desktop": "sidebar"
      }
    },
    "layered_images_with_text_NyXyEa": {
      "type": "layered-images-with-text",
      "blocks": {
        "heading_tR6NcK": {
          "type": "heading",
          "settings": {
            "text": "T-shirt Printing",
            "marker_style": "style1",
            "heading_size": "h3",
            "marker_color": "#fd6262"
          }
        },
        "text_G3MW3t": {
          "type": "text",
          "settings": {
            "text": "<p>There are various technologies that can be used to transfer desired designs on different kinds of fabric, such as vinyl cutting, sublimation, DTG printing, DTF printing and embroidery. From sublimation printers and sublimation equipment to digital textile printers, each technology has its own advantages depending on the production scale and material type.</p><p>Considering factors like investment cost, printing quality and learning curve, both DTG and DTF printers are outstanding choices for small scaled businesses. </p><p>For people who are running a print-on-demand T-shirt business, owning a t shirt printer allows you to make products at home quickly and shorten the order fulfill time. Through in-house printing, you can take full control on the printing quality and timely adjust your designs to meet the requirements of your customers. In long run, this can build up your business reputation and increase the trust from your customers. </p>"
          }
        }
      },
      "block_order": [
        "heading_tR6NcK",
        "text_G3MW3t"
      ],
      "settings": {
        "image": "shopify://shop_images/1_cd8adbff-a5d8-4f87-addf-ba6c28dc8725.png",
        "image_ratio": "square",
        "image_2": "shopify://shop_images/Luminous_20DTF_20Transfer_20Film.00_00_30_15.Still001.jpg",
        "image_ratio_2": "adapt",
        "image_3": "shopify://shop_images/tshirt-business_27786f3f-37f1-4264-9f57-40392320c2ec.jpg",
        "image_ratio_3": "adapt",
        "full_width": false,
        "layout": "image_first",
        "content_alignment": "text-left",
        "content_position": "middle",
        "disable_top_spacing": true,
        "disable_bottom_spacing": false
      }
    },
    "multicolumn_cRkRHa": {
      "type": "multicolumn",
      "blocks": {
        "column_Lh3aXx": {
          "type": "column",
          "settings": {
            "image_full_width": false,
            "image_link": "",
            "title": "Sublimation Printer",
            "text": "<p>A sublimation printer is designed specifically for printing vibrant, full-color designs on polyester fabrics. When using a sublimation printer, the dye bonds with the fabric, providing long-lasting prints that won’t fade or peel. This method is ideal for T-shirt printing, especially when you're looking for high-quality, detailed designs. The use of a sublimation printer allows for smooth, continuous colors that make your custom designs stand out.</p>",
            "link_label": "",
            "link": ""
          }
        },
        "column_KKzDAe": {
          "type": "column",
          "settings": {
            "image_full_width": false,
            "image_link": "",
            "title": "Sublimation Equipment",
            "text": "<p>Sublimation equipment refers to the complete setup required for sublimation printing. It includes not just a sublimation printer, but also transfer papers, sublimation inks, and heat press machines. By investing in quality sublimation equipment, you can ensure that your prints are vivid, durable, and professionally finished. Whether you're printing T-shirts or other products, having the right sublimation equipment is essential for achieving optimal results.</p>",
            "link_label": "",
            "link": ""
          }
        },
        "column_h6HnmE": {
          "type": "column",
          "settings": {
            "image_full_width": false,
            "image_link": "",
            "title": "Digital Textile Printers",
            "text": "<p>Digital textile printers are advanced machines that offer flexibility in printing on a variety of fabrics, including cotton, polyester, and blends. While digital textile printers can use different printing techniques, including sublimation printing, they provide a wide range of options for custom T-shirt printing. With digital textile printers, you can print detailed and colorful designs on different types of fabric, making it a versatile choice for your T-shirt printing business.</p>",
            "link_label": "",
            "link": ""
          }
        }
      },
      "block_order": [
        "column_Lh3aXx",
        "column_KKzDAe",
        "column_h6HnmE"
      ],
      "name": "Multicolumn",
      "settings": {
        "heading": "Sublimation Printers vs Sublimation Equipment vs Digital Textile Printers",
        "marker_style": "style1",
        "description": "<p>These three terms are related to T-shirt printing but are not exactly the same. They have different definitions and use cases.</p>",
        "columns_desktop": 4,
        "mobile_swipe": false,
        "image_ratio": "adapt",
        "text_alignment": "left",
        "heading_size": "h5",
        "color_heading": "#1a1c1d",
        "marker_color": "#FD6262",
        "color_text": "#2c2d2e",
        "color_links": "#2c2d2e",
        "disable_top_spacing": false,
        "disable_bottom_spacing": false
      }
    },
    "image_with_text_CttBHf": {
      "type": "image-with-text",
      "blocks": {
        "heading_UpHxky": {
          "type": "heading",
          "settings": {
            "text": "How to Operate and Maintain Your T Shirt Printer",
            "marker_style": "style1",
            "heading_size": "h3",
            "marker_color": "#FD6262"
          }
        },
        "text_L6X8LF": {
          "type": "text",
          "settings": {
            "text": "<p>To get started with your T shirt printing machine, ensure that you have all the necessary materials ready, including the blank shirts, inks, and transfer paper (if applicable). Begin by setting up your design on the software that comes with the t shirt printer machine, ensuring the correct dimensions and resolution for optimal print quality. Once the design is ready, load the T-shirt onto the platen, adjust the settings (such as temperature, pressure, and print speed) based on the material you're using, and start the printing process. <br/><br/>Regular maintenance is key to ensuring the longevity and performance of your T shirt printing machine<strong>. </strong>Clean the printhead and other components after each use to prevent ink build-up, which could affect print quality. Make sure to check for any ink residue or dust in the machine and clean it with appropriate tools. It's also important to periodically inspect the platen and replace worn-out parts, such as the ink cartridges or transfer sheets. This helps maintain print accuracy and prevents costly repairs or downtime. </p><p><br/>Even with regular maintenance, your T shirt printing machine may encounter occasional problems. If you notice ink smudging, blurry prints, or misalignment, check the printhead and alignment settings. For ink-related issues, ensure you're using the correct type of ink for the material and t shirt printer machine. </p>"
          }
        }
      },
      "block_order": [
        "heading_UpHxky",
        "text_L6X8LF"
      ],
      "name": "Image with text",
      "settings": {
        "image": "shopify://shop_images/20250724-103318.png",
        "use_modal": false,
        "use_video": false,
        "video": "https://www.youtube.com/watch?v=_9VUPq3SxOc",
        "video_autoplay": true,
        "height": "adapt",
        "desktop_image_width": "medium",
        "full_width": false,
        "layout": "image_first",
        "content_position": "text-left",
        "column_spacing": "medium",
        "color_bg": "#f4f4f4",
        "color_text_bg": "#ffffff",
        "color_text": "#2c2d2e",
        "color_border": "#e2e2e2",
        "disable_top_spacing": false,
        "disable_bottom_spacing": false
      }
    }
  },
  "order": [
    "breadcrumbs",
    "template-header",
    "product-grid",
    "layered_images_with_text_NyXyEa",
    "multicolumn_cRkRHa",
    "image_with_text_CttBHf"
  ]
}
